       IDENTIFICATION DIVISION.
      *Autor, data, program ID
       PROGRAM-ID. PROG1.
       ENVIRONMENT DIVISION.
      *Especificação de maquinas diferentes
       DATA DIVISION.
      *Variaveis

       PROCEDURE DIVISION.
      *logica, codigos do program
       PROGRAM-BEGIN.
           DISPLAY "Hello World!".

       PROGRAM-DONE.
           STOP RUN.
