       IDENTIFICATION DIVISION.
      *constantes
       PROGRAM-ID. PROG2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           DISPLAY "HELLO WORLD".
      *STRING
           DISPLAY 55.
      *INTEIRO
           DISPLAY 12.607.
      *DECIMAL (PONTO AO INVÉS DA ,)

       PROGRAM-DONE.
           STOP RUN.
